# creating series

In [1]:
import  pandas as pd

In [6]:
Name=["Tanisha","Nandani","Komal","Vedant","Avantika"]
Name

['Tanisha', 'Nandani', 'Komal', 'Vedant', 'Avantika']

In [7]:
Roll_list=pd.Series(Name,index=[1,2,3,4,5])
print(Roll_list)

1     Tanisha
2     Nandani
3       Komal
4      Vedant
5    Avantika
dtype: object

# Creating Data Frame

In [8]:
import pandas as pd

In [13]:
df=pd.DataFrame([[1,2,3,4],[6,7,8,9],[11,12,13,14],[16,17,18,19]],
columns= ["Bia","DBMS","OE","DSS"])

In [14]:
df

   Bia  DBMS  OE  DSS
0    1     2   3    4
1    6     7   8    9
2   11    12  13   14
3   16    17  18   19

In [15]:
df.shape

(4, 4)

In [16]:
df.size

16

In [17]:
df.ndim

2

# Adding Record(Row)

In [18]:
df2=pd.DataFrame([[21,22,23,24]],
columns= ["Bia","DBMS","OE","DSS"])

In [20]:
df3 =pd.concat([df,df2], ignore_index=True)

In [21]:
df3

   Bia  DBMS  OE  DSS
0    1     2   3    4
1    6     7   8    9
2   11    12  13   14
3   16    17  18   19
4   21    22  23   24

# Adding Attribute(coloumn)in a data frame

In [23]:
df3["DM"]=[21,22,23,24,25]

In [24]:
df3

   Bia  DBMS  OE  DSS  DM
0    1     2   3    4  21
1    6     7   8    9  22
2   11    12  13   14  23
3   16    17  18   19  24
4   21    22  23   24  25

# Deleting Record From Data Frame

In [25]:
df4=df3.drop(1)

In [26]:
df4

   Bia  DBMS  OE  DSS  DM
0    1     2   3    4  21
2   11    12  13   14  23
3   16    17  18   19  24
4   21    22  23   24  25

# Deleting Attribute(Columns) From df3 dataframe

In [28]:
df5=df3.drop(columns=["DM"])

In [29]:
df5

   Bia  DBMS  OE  DSS
0    1     2   3    4
1    6     7   8    9
2   11    12  13   14
3   16    17  18   19
4   21    22  23   24

In [31]:
print("Mean of DSS:", df5["DSS"].mean())

Mean of DSS: 14.0

In [34]:
print("Median of DSS:", df5["DSS"].median())

Median of DSS: 14.0

In [35]:
print("Mode of DSS:", df5["DSS"].mode())

Mode of DSS: 0     4
1     9
2    14
3    19
4    24
Name: DSS, dtype: int64